{
  "title": "Motion Med Sync",
  "subtitle": "A modern platform designed to streamline participant data management, integrate with Garmin services, and provide robust analytics tools for researchers.",
  "sections": [
    {
      "name": "Core Requirements",
      "requirements": [
        {
          "title": "User Account Management",
          "description": [
            "Administrators must be able to create, manage, and deactivate user accounts.",
            "The system must enforce role-based access to protect participant data."
          ]
        },
        {
          "title": "User Authentication via Magic Links",
          "description": [
            "Users must authenticate through magic links sent to their registered email addresses.",
            "Magic links must expire 10 minutes after they are issued.",
            "Each magic link must be valid for a single use only.",
            "Requesting a new magic link must immediately invalidate any previously issued, unused links.",
          ]
        },
        {
          "title": "User Roles and Permissions",
          "description": [
            "The system must define two roles: administrators and researchers.",
            "Administrators must have full system access, including creating studies and managing user access.",
            "Researchers must only view and analyze data for studies they are explicitly granted access to.",
            "Participants will not have direct system access and interact only via Garmin devices."
          ]
        },
        {
          "title": "Login and Password Recovery",
          "description": [
            "Users must be able to securely log in and reset forgotten passwords via email."
          ]
        },
        {
          "title": "Study Management and Access Control",
          "description": [
            "Administrators must be able to create new studies and manage access permissions.",
            "Researchers must only access studies assigned to them.",
            "The system must allow administrators to disable inactive studies.",
            "Participants must be assigned to specific studies for organization and tracking."
          ]
        },
        {
          "title": "Study and Participant Completion",
          "description": [
            "Administrators must be able to mark both studies and participants as completed.",
            "Once completed, no new data can be added or modified.",
            "Garmin data sync must stop for completed participants and studies."
          ]
        },
        {
          "title": "CSV Download Options",
          "description": [
            "Researchers must be able to export participant data in CSV format for studies they have access to.",
            "The system must provide download options for either detailed data or summary data only.",
            "Bulk CSV downloads must be available for entire studies."
          ]
        },
        {
          "title": "Participant Profile Creation",
          "description": [
            "Researchers must be able to create and manage participant profiles.",
            "Participants must be able to be deactivated if needed."
          ]
        },
        {
          "title": "Garmin Account Integration",
          "description": [
            "The system must support linking participant profiles to Garmin accounts for automatic data syncing.",
            "Researchers must be able to revoke and re-grant Garmin access as needed."
          ]
        },
        {
          "title": "View Participant Data",
          "description": [
            "Researchers must be able to view participant data for studies they are assigned to.",
            "The system must display historical trends and metrics in an intuitive interface to support analysis."
          ]
        },
        {
          "title": "Deactivate Participant",
          "description": [
            "Researchers must be able to deactivate a participant when necessary.",
            "Deactivating a participant must automatically disconnect their Garmin account.",
            "Deactivated participants must not appear on adherence tracking or 8+ day compliance lists.",
            "Deactivated participants must be listed at the bottom of the participant roster."
          ]
        }
      ]
    },
    {
      "name": "Analytics & Data Management",
      "requirements": [
        {
          "title": "Dashboard Overview",
          "description": [
            "The system must provide a high-level dashboard showing total studies, active participants, and key performance metrics."
          ]
        },
        {
          "title": "Garmin Data Synchronization",
          "description": [
            "The system must automatically pull activity and health data from Garmin accounts.",
            "The system must verify Garmin access is granted before syncing data.",
            "Data synchronization must maintain up-to-date participant information."
          ]
        },
        {
          "title": "Raw Data Backup",
          "description": [
            "The system must back up raw participant data securely.",
            "Backups must include both raw JSON files and original .fit files from Garmin.",
            "The backup process must minimize data loss and preserve data integrity."
          ]
        },
        {
          "title": "Database Storage",
          "description": [
            "All participant data must be securely stored in a structured database to support long-term storage and analytics."
          ]
        },
        {
          "title": "Participant Activity Calendar",
          "description": [
            "The system must generate a visual calendar of participant activities, including workouts and therapies.",
            "Researchers must be able to use the calendar to monitor engagement and adherence to study protocols."
          ]
        },
        {
          "title": "CSV Processing for Summaries and Time Series",
          "description": [
            "The system must process uploaded CSV files to generate statistical summaries and time-series data.",
            "Researchers must be able to analyze trends and generate reports from this data."
          ]
        },
        {
          "title": "Participant Profile Settings",
          "description": [
            "Clinicians must be able to configure individual participant profiles with target heart rate and cadence ranges.",
            "These profile settings must be used to calculate summary metrics and customize participant analysis."
          ]
        }
      ]
    },
    {
      "name": "Security and Session Management",
      "requirements": [
        {
          "title": "Session Timeout and Security",
          "description": [
            "Users must be automatically logged out after 15 minutes of inactivity.",
            "Sessions must expire after a maximum of 12 hours, regardless of user activity.",
            "Users must be logged out when they close their browser.",
            "A warning must be displayed to users 1 minute before automatic logout.",
            "Users must reauthenticate via magic link after session expiration or browser closure."
          ]
        }
      ]
    }
  ]
}
